[Reference](https://towardsdatascience.com/8-ways-to-filter-pandas-dataframes-d34ba585c1b8)

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'name':['Jane','John','Ashley','Mike','Emily','Jack','Catlin'],
'ctg':['A','A','C','B','B','C','B'],
'val':np.random.random(7).round(2),
'val2':np.random.randint(1,10, size=7)})

In [4]:
df[df.val > 0.5]

     name ctg   val  val2
0    Jane   A  0.91     8
1    John   A  0.52     2
4   Emily   B  1.00     5
6  Catlin   B  0.55     3

In [5]:
df[df.name > 'Jane']

   name ctg   val  val2
1  John   A  0.52     2
3  Mike   B  0.20     4

In [6]:
df[(df.val > 0.5) & (df.val2 == 1)]

Empty DataFrame
Columns: [name, ctg, val, val2]
Index: []

In [7]:
df[(df.val < 0.5) | (df.val2 == 7)]

     name ctg   val  val2
2  Ashley   C  0.27     1
3    Mike   B  0.20     4
5    Jack   C  0.15     2

In [8]:
names = ['John','Catlin','Mike']
df[df.name.isin(names)]

     name ctg   val  val2
1    John   A  0.52     2
3    Mike   B  0.20     4
6  Catlin   B  0.55     3

In [9]:
df[df.name.str.startswith('J')]

   name ctg   val  val2
0  Jane   A  0.91     8
1  John   A  0.52     2
5  Jack   C  0.15     2

In [10]:
df[df.name.str.contains('y')]

     name ctg   val  val2
2  Ashley   C  0.27     1
4   Emily   B  1.00     5

In [11]:
df[~df.name.str.startswith('J')]

     name ctg   val  val2
2  Ashley   C  0.27     1
3    Mike   B  0.20     4
4   Emily   B  1.00     5
6  Catlin   B  0.55     3

In [12]:
df.query('ctg == "B" and val > 0.5')

     name ctg   val  val2
4   Emily   B  1.00     5
6  Catlin   B  0.55     3

In [13]:
df.nlargest(3, 'val')

     name ctg   val  val2
4   Emily   B  1.00     5
0    Jane   A  0.91     8
6  Catlin   B  0.55     3

In [14]:
df.nsmallest(2, 'val2')

     name ctg   val  val2
2  Ashley   C  0.27     1
1    John   A  0.52     2

In [15]:
df.iloc[3:5, :] #rows 3 and 4, all columns

    name ctg  val  val2
3   Mike   B  0.2     4
4  Emily   B  1.0     5

In [16]:
df.loc[3:5, :] #rows 3 and 4, all columns

    name ctg   val  val2
3   Mike   B  0.20     4
4  Emily   B  1.00     5
5   Jack   C  0.15     2

In [17]:
df.index = ['a','b','c','d','e','f','g']

In [18]:
df.loc['b':'d', :]

     name ctg   val  val2
b    John   A  0.52     2
c  Ashley   C  0.27     1
d    Mike   B  0.20     4